Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་མི(་,)འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Questions of the Kiṃnara King Druma

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time:

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་རི་བྱ་རྒོད་ཀྱི་ཕུང་པོ་ལ་དགེ་སློང་དྲུག་ཁྲི་ཉིས་སྟོང་གི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕལ་ཆེར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པ་བདུན་ཁྲི་ཉིས་སྟོང་ཐམས་ཅད་ཀྱང་མངོན་པར་ཤེས་པས་མངོན་པར་ཤེས་པ།
en: The Blessed One was residing on Vulture Peak in Rājagṛha together with a great saṅgha of sixty-two thousand monks, and with seventy-two thousand bodhisattva great beings who had gathered from the worlds of the ten directions. All of them had developed the higher perceptions.

source: གཟུངས་རབ་ཏུ་ཐོབ་པ། སྤོབས་པ་ཆགས་པ་མེད་པ། ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ། དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་དང་། མོས་པ་དང་། ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་ཕུན་སུམ་ཚོགས་པ། བསམ་པ་རྡོ་རྗེ་ལྟར་བརྟན་ཞིང་མི་ཕྱེད་པ།
en: They had attained recollection, unobstructed eloquence, and absorption. They were perfectly mindful, intelligent, realized, devoted, humble, and modest. Their motivation was firm and indivisible like vajra.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ། ལྷག་པའི་བསམ་པ་ཁྱད་པར་དུ་འཕགས་པ་ལ་ཞུགས་པ།
en: They perfectly applied themselves to all the qualities of buddhahood, and they had developed the most noble motivation.

source: བདག་ཉིད་བྱང་ཆུབ་ཀྱི་སེམས་མི་འདོར་བ། སེམས་ཅན་གཞན་བྱང་ཆུབ་ཀྱི་སེམས་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ།
en: Without ever themselves forsaking the mind set on awakening, they caused others to adopt that same attitude.

source: སྦྱིན་པ་དང་། དུལ་བ་དང་། སྡོམ་པ་དང་། དེས་པ་དང་། བཟོད་པ་དང་། སྡུག་པའི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་། ཡོངས་སུ་བསྔོ་བའི་ཆོ་ག་ཤེས་པ།
en: They were generous, self-controlled, restrained, gentle, and patient. Everything that was pleasant they would give away, and knew how to dedicate these acts.

source: ལུས་དང་། ངག་དང་། སེམས་དང་། ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་གྱིས་ལེགས་པར་བརྒྱན་པ། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་དང་། བཟོད་པ་དང་། དེས་པའི་སྟོབས་ཀྱི་གོ་ཆ་ཤིན་ཏུ་བགོས་པ།
en: Their bodies, speech, and minds were adorned with the ornament of discipline. They had an impartial attitude toward all beings and they had donned the powerful armors of patience and gentleness.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་གྲངས་མེད་པར་བརྩོན་འགྲུས་ཤིན་ཏུ་བརྩམས་པ། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་རོལ་པ།
en: They had exercised diligence for countless billions of eons, and they reveled in the wisdom of the concentrations, liberations, absorptions, attainments, and higher knowledges.

source: ཚིག་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བ་ལ་སྤོབས་པ་ཆགས་པ་མེད་པའི་ཤེས་རབ་དང་། ཡེ་ཤེས་ལ་མཁས་པ། རི་རབ་ཀྱི་རི་ལྟར་སེམས་གཡོ་བ་མེད་པ། ས་དང་། ཆུ་དང་། མེ་དང་། རླུང་དང་། རི་ལྟར་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བ་
en: They were experts in the wisdom and insight of unobstructed eloquence with respect to the distinctions of all words. Their minds were unshakeable like Mount Sumeru. Like earth, water, fire, wind, and mountains they were free of attachment and anger.

source: !བྱམས་པ་ཆེན་པོ་ལ་གནས་ཏེ་འོད་ཟེར་ཐོགས་པ་མེད་པ། སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་ཏེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བྱ་བ་གཅིག་ལ་བརྩོན་པ། དགའ་བ་ཆེན་པོ་ལ་གནས་ཏེ་ཆོས་ལ་དགའ་ཞིང་མགུ་བ་དང་ལྡན་པ། བཏང་སྙོམས་ཆེན་པོ་ལ་གནས་པར་བརྩོན་པ། གཉིས་སུ་མེད་པའི་ཡེ་ཤེས་རབ་ཏུ་ཐོབ་པ།
en: They were abiding in great love and their splendor was unobstructed. They were abiding in great compassion and always diligent in caring for all beings. They were abiding in great joy and were delighted by the joy of Dharma. They were abiding in great equanimity and had reached nondual cognition.

source: འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་པོ་རྙེད་པ་དང་། མ་རྙེད་པ་དང་། གྲགས་པ་དང་། མ་གྲགས་པ་དང་། བསྟོད་པ་དང་། སྨད་པ་དང་། བདེ་བ་དང་། སྡུག་བསྔལ་ལས་རབ་ཏུ་འདས་པ།
en: They had completely transcended the eight worldly concerns—gain, loss, fame, disgrace, praise, blame, pleasure, and suffering.

source: ཕ་རོལ་རྒོལ་བ་ངན་པའི་ཚོགས་ཅན་གྱི་ཚོགས་ཐམས་ཅད་ཀུན་དུ་རབ་ཏུ་འཇོམས་པ། བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ།
en: They had utterly defeated all the multitudes of wicked opponents and conquered the hostile forces of Māra and the afflictions.

source: !ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་མཐོང་བ་ལྟར་ཤིན་ཏུ་འབྱུང་བར་དཀའ་བ། གསོལ་བ་མ་བཏབ་པར་སེམས་ཅན་ཐམས་ཅད་ལ་དགེ་བའི་བཤེས་གཉེན་བྱེད་པ། རབ་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བཤེས་གཉེན་བྱེད་པ།
en: Their presence was as rare as the sight of the uḍumbara flower and, without being asked, they acted as virtuous friends for all sentient beings, always accompanying them until nirvāṇa.

source: སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཟབ་མོ་དང་མི་འཇིགས་པ་སྒྲོགས་པ།
en: They uttered the great lion’s roar, resounding with the profound Dharma of the Buddha as well as with fearlessness.

source: དེ་བཞིན་གཤེགས་པའི་ཕྱག་རྒྱས་བཏབ་པ། མི་འཁྲུགས་པར་ཕྱད་པར་ལུང་སྟོན་པ། ཇི་ལྟར་སྨྲས་པ། དེ་བཞིན་བྱེད་པ།
en: They were marked by the seal of the thus-gone ones. They taught clearly without any disturbance and their actions accorded with their words.

source: དེ་ཁོ་ནའི་ཆོས་ཀྱི་ཚུལ་ལ་བརྩོན་པ་འོད་ཀྱིས་ཉི་མ་དང་ཟླ་བ་མོག་མོག་པོར་བྱེད་པ།
en: They were diligent in the Dharma-way of suchness, and their light eclipsed the light of the sun and the moon.

source: ཕྱོགས་བཅུར་སྒྲ་བསྒྲགས་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་སེམས་པ། ཆོས་དཀོན་མཆོག་གི་མཛོད་ཡང་དག་པར་འཛིན་པ།
en: Their voices resounded throughout the ten directions, they contemplated all buddha qualities, and they upheld the treasury of the Dharma jewel.

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་མི་གཅོད་པར་ཡིད་ལ་བྱེད་པ། སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པ་འདའ་བ་ལ་མཁས་པ།
en: Their minds were focused on keeping the lineage of the Three Jewels unbroken. They were skilled in traveling to an infinity of buddha realms.

source: ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་རྣམ་པར་འབྱེད་པ་གནས་པའི་བློ་དང་ལྡན་པ་མཐོང་བ་དང་། ཐོས་པ་དོན་ཡོད་པས་རྣམ་པར་གནོན་པ།
en: They had the intelligence that is grounded in the discernment of all distinctions. To see and hear them was so beneficial that it was overwhelming.

source: རྟག་པར་རྒྱུན་དུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ལ་བརྩོན་པ། ཤེས་རབ་དང་ཐབས་ལ་མཁས་པའི་མཆོག་ཐོབ་པ།
en: They constantly exerted themselves to bring sentient beings to maturity and they had reached the highest level of mastering insight and methods.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པས་ཅི་རིགས་པར་ཆོས་སྟོན་པ།
en: They taught the Dharma to all sentient beings in the appropriate manner, knowing those who were of the highest faculties and those who were not.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལ་ལྟ་བའི་ཆོ་ག་ལ་མཁས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཇུག་པ་དང་བཏགས་པ་ལ་བདེ་བླག་ཏུ་མཁས་པ།
en: They were skilled in observing the conduct of all sentient beings and they were naturally skilled in the pursuits and imputations of all beings.

source: མི་འཇིགས་པ་ཆེན་པོས་འཇིགས་པ་མེད་པ། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་བྱེད་པ།
en: Due to their great fearlessness, they were dauntless, and they were utterly at peace from old age, sickness, death, and the afflictions.

source: སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པ་ལ་དགེ་བའི་རྩ་བ་བསྐྲུན་པ།
en: They had created roots of virtue in relation to a boundless number of billions of buddhas.

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པའི་བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་བསགས་པ།
en: They had gathered the accumulation of merit that completes the excellent major and minor marks, and they had also gathered the accumulation of wisdom.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཆོས་ཐམས་ཅད་ལ་མོས་པ་ལ། སྨོན་པ་མེད་པ་སེམས་ཅན་དང་། ཆོས་ཐམས་ཅད་སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། རྨི་ལམ་དང་། ཆུ་ཟླ་དང་། མིག་ཡོར་དང་། བྲག་ཅ་དང་། ནམ་མཁའ་དང་མཚུངས་པར་མོས་པ།
en: They were inclined toward all the qualities of emptiness, the absence of marks, and the absence of wishes. They were free from aspiration. They were confident in the insight that all beings and phenomena are like illusions, mirages, dreams, reflections of the moon in water, optical illusions, echoes, and space.

source: སྒྲ་སྐད་ཐམས་ཅད་ངེས་པའི་ཚིག་གིས་སྟོན་པའི་ཡེ་ཤེས་ལ་མཁས་པ། ཆོས་དང་། དོན་དང་ངེས་པའི་ཚིག་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ།
en: They were experts in the wisdom that teaches in the words of all languages, and they had achieved the four correct knowledges related to phenomena, meaning, language, and eloquence.

source: འཇིག་རྟེན་ལས་འདས་པའི་ཤེས་རབ་ཀྱི་དབང་པོ་མངོན་སུམ་དུ་གྱུར་པ། ཤུགས་ཆེན་པོ་འཛིན་པའི་སྟོབས་བཅུ་ལ་ཉེ་བར་གྱུར་པ། ཤའི་མིག་དང་། ལྷའི་མིག་དང་། ཤེས་རབ་ཀྱི་མིག་དང་། ཆོས་ཀྱི་མིག་དང་། སངས་རྒྱས་ཀྱི་སྤྱན་སྣང་བ་ཐོབ་པ།
en: They had actualized the power of supramundane insight, obtained the ten powers that possess great might, and developed the perceptions of the physical eye, the divine eye, the insight eye, the Dharma eye, and the buddha eye.

source: ལམ་གྱི་ཡན་ལག་གི་ཚོགས་ཤིན་ཏུ་བསགས་པའི་ལམ་ཐམས་ཅད་ལ་འཇུག་པའི་ཡེ་ཤེས་ལ་མཁས་པ།
en: They were experts in the wisdom that engages in all the ways of gathering the accumulations related to the branches of the path.

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་སྣང་བ་ལ་འཇུག་པའི་ཆོ་ག་ཤེས་པ། ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ།
en: They knew the procedures for developing the understanding of the bodhisattvas’ scriptural collection. They turned the irreversible Dharma wheel.

source: མཚན་ཉིད་ཀྱི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ། རྡོ་རྗེ་དཀྱིལ་འཁོར་གྱི་ཏིང་ངེ་འཛིན་ལ་འཇུག་པའི་ཡེ་ཤེས་ལ་མཁས་པ། ཆོས་ཐམས་ཅད་ལ་དབང་བྱེད་པའི་ཏིང་ངེ་འཛིན་མངོན་དུ་གྱུར་པ།
en: They had reached the absorption of the seal of characteristics . They were experts in the wisdom related to the absorption of the vajra circle . They had manifested the absorption that controls all phenomena .

source: ཆོས་དཀོན་མཆོག་གི་སྒྲོན་མ་འཛིན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུད་ལ་རྣམ་པར་ལྟ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་བསམ་པ་ལ་རྣམ་པར་ལྟ་བར་མཁས་པ།
en: They held the torch of the supreme Dharma Jewel. They perceived the mindstreams of all beings and were experts in seeing their thoughts.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་བྱ་བས་སོ་སོར་ཉེ་བར་གནས་པ་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཡོན་ཏན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: They were attending to all beings through the activity of awakened wisdom and they were adorned with all the precious qualities replete with the most supreme of all aspects.

source: བསྐལ་པ་ཐམས་ཅད་དུ་བསྔགས་པ་ཡོངས་སུ་བརྗོད་ཀྱང་མཐར་མི་ཕྱིན་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ།
en: Even if their praises were proclaimed for all the eons, this task would never come to an end.

source: !བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་བྱེད་དང་། དགའ་འབྱུང་དང་། ལག་ན་རིན་པོ་ཆེ་དང་། རིན་ཆེན་མེ་ཏོག་དང་། རིན་པོ་ཆེའི་ཏོག་དང་། མཐོང་དགའ་དང་། མིག་གིས་མཐོང་དགའ་དང་། མཛེས་པའི་བློ་གྲོས་དང་། དགའ་ཞིང་མཆོག་ཏུ་དགའ་བྱེད་དང་། ས་འཛིན་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། མཐུ་ཆེན་ཐོབ་དང་། དཔལ་ཆེན་དང་། བདུད་ཐུལ་དང་། མེ་ཏོག་མན་དཱ་ར་བའི་དྲི་དང་། རླུང་ལྷ་དང་། བདེན་དགའ་དང་། མཉམ་ལྟ་དང་། རི་རབ་རྩེ་འཛིན་དང་། རི་རབ་བརྩེགས་དང་། རི་རབ་མཆོག་དང་། དྲ་བ་ཅན་གྱི་འོད་དང་། རྒྱལ་བའི་བློ་གྲོས་དང་། སྐྱེ་བར་ཚིམ་བྱེད་དང་། འགྲོ་བ་འཛིན་དང་། ལྷའི་རྒྱལ་པོས་མཆོད་དང་། མཆོག་གི་བློ་གྲོས་དང་། ཐོགས་མེད་སེམས་དང་། སྐྱ་རིང་བློ་གྲོས་དང་། མི་སྐྱོབ་པ་དང་། དཔག་མེད་རིན་ཆེན་མཛོད་དང་། འོད་ཀྱི་ཏོག་དང་། འོད་དཔལ་དང་། སྒྲོན་མའི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་བློ་གྲོས་དང་། འོད་ཀྱིས་ཡང་དག་བརྒྱན་དང་། སྣ་ཚོགས་མེ་ཏོག་དང་། ལྷའི་རྒྱལ་པོ་དང་། ལྷའི་ཚུལ་གྱིས་ལྟ་བ་དང་། དཔུང་བཟང་དང་། ལེགས་པར་བསམ་པ་སེམས་པ་དང་། འཁོར་ལོ་རབ་གནས་རྐང་པ་དང་། མི་གཡོ་རྐང་པས་རྣམ་པར་གནོན་དང་། རྡོ་རྗེའི་རྐང་པས་རྣམ་པར་གནོན་དང་། རྐང་པས་འཇིག་རྟེན་གསུམ་རྣམ་པར་གནོན་དང་། དགའ་སྤོབས་དང་། སྤོབས་མྱུར་དང་། སྤོབས་པ་མི་འཆད་པ་དང་། སྤོབས་པ་བྱིན་གྱིས་བརླབས་དང་། འཇམ་སྒྲ་དང་། སེམས་ཅན་ཐམས་ཅད་ཚིམ་བྱེད་དང་། ཚངས་དབྱངས་དང་། བཟང་སྐྱོང་དང་། རིན་ཆེན་འབྱུང་གནས་དང་། དེད་དཔོན་བཟང་པོ་དང་། མིས་བྱིན་དང་། ཆུ་ལྷ་དང་། བྱམས་པ་དང་། འཇམ་དབྱངས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བདུན་ཁྲི་ཉིས་སྟོང་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: Among the seventy-two thousand bodhisattvas were the bodhisattva great beings Priyaṃkara, Source of Joy, Ratnapāṇi, Ratnakusuma, Ratnaketu, Priyadarśana, Delightful to Behold, Ruciramati, Pleasing and Delightful, Dharaṇī­dhara, Avalokiteśvara, Mahāsthāmaprāpta, Great Glory, Mārajit, Mandārava­gandha, Vāyu, Joy of Truth, View of Equality, Meruśikhara­dhara, Merukūṭa, Meruvara, Jālinīprabha, Jayamati, Soothing Birth, Jagatīṃdhara, Worshiped by the King of Gods, Uttaramati, Asaṅgacitta, Dawn Intellect, Protector of Men, Boundless Precious Treasure, Prabhāketu, Prabhāśrī, Pradīparāja, Bodhimati, Adorned with Light, Manifold Flowers, Devarāja, Divine Perception, Subāhu, Sucintitacintin, Feet Consecrated with Wheels, Trampling with Unmoving Feet, Trampling with Vajra Feet, Subjugating the Three Worlds under One’s Feet, Joyful Eloquence, Swift Eloquence, Anācchedya­pratibhāna, Blessed Eloquence, Gentle Sounds, Provider of All Beings’ Satisfaction, Brahmaghoṣa, Bhadrapāla, Ratnākara , Susārthavāha, Naradatta, Varuṇa, Maitreya, Mañjughoṣa, and Mañjuśrī­kumāra­bhūta.

source: གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། དེ་ལས་གཞན་པ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་རྣམས་བཅོམ་ལྡན་འདས་ལ་ལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ། །
en: Also present were Śakra, Brahmā, and the protectors of the world, as well as gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, mahoragas, humans, and nonhumans. They had all come from all parts of this great trichiliocosm and gathered in the assembly to behold the Blessed One, pay homage to him, revere him, and listen to the Dharma.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷའི་ཅོད་པན་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པ་དེས། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཆེན་པོ་དེ་འདུས་པར་རིག་ནས་སྟན་ལས་ལངས་ཏེ།
en: At that time, the bodhisattva great being Divyamauli was part of that retinue. When he saw that great assembly of bodhisattvas, he stood up,

source: བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས།
en: draped his shawl over one shoulder,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: prostrated to the feet of the Blessed One, circumambulated him three times, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: Bowing down with his palms joined together in the direction of the Blessed One, he uttered these verses of praise:

source: འཇིག་རྟེན་འདས་པ་འཇིག་རྟེན་སྒྲོན་མ་མཛད། །
en: “You have transcended the world and serve as a lamp for its inhabitants.

source: ཁྱོད་ནི་འཇིག་རྟེན་དོན་མཛད་བློ་གྲོས་ལྡན། །
en: Wise One, you accomplish the benefit of the world,

source: སྣང་བ་བརྙེས་ཤིང་ཉོན་མོངས་དྲི་བསལ་བ། །འཇིག་རྟེན་སྣང་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: You have reached illumination, and you eliminate the stains of afflictions; Illuminator of the world, I pay homage to you!

source: སྦྱིན་ལ་དགྱེས་ཤིང་སྟོབས་བཅུ་མཆོག་མངའ་བ། །དུལ་བ་འདུལ་བ་གདུལ་བའི་ཕ་རོལ་ཕྱིན། །
en: “You delight in generosity, you possess the ten supreme powers, You are gentle and restrained, and you have reached the culmination of discipline.

source: བཅོམ་ལྡན་ལྷ་དང་མི་དང་ཀླུས་མཆོད་པ། །གདུལ་བའི་མཐར་ཕྱིན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Blessed One, you are worshiped by gods, humans, and nāgas, And you have perfected discipline; I pay homage to you!

source: མཚན་མཆོག་འགྲོ་བ་མང་པོའི་དོན་མཛད་པ། །འདོམ་གང་འོད་ནི་གསེར་གྱི་ཁ་དོག་ལྟ། །དགེ་བའི་མཚན་གྱི་དམ་པའི་གཟུགས་མངའ་བ། །སྲིད་གསུམ་མཚུངས་མེད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “You possess the supreme marks and accomplish the benefit of many beings. Your aura of light has the color of gold, You are endowed with a sacred physical form adorned with the marks of virtue, And you are peerless in the three realms; I pay homage to you!

source: !ཕ་རོལ་ཕྱིན་པས་གཞན་གྱི་ཚོགས་འཇོམས་ཤིང་། །ཕ་རོལ་རྒོལ་བའི་རྒོལ་འཇོམས་མི་གཡོ་བ། །སེམས་ཅན་གཞན་གྱི་སེམས་དང་སྤྱོད་ལ་མཁས། །ཐུགས་རྗེ་མཆོག་མངའ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “You who have reached the other shore, you have vanquished hosts of enemies, And you unflaggingly defeat your opponents. You are an expert in sentient beings’ mental activity, And you possess supreme compassion; I pay homage to you!

source: དགྲ་བཅོམ་རྒྱལ་པོ་ཉོན་མོངས་རྡུལ་བསལ་བ། །འཚོ་བ་དག་ཅིང་བརྟུལ་ཞུགས་ཚུལ་ཁྲིམས་གནས། །
en: “King of the worthy ones, you have cleared away the dust of the afflictions, And you abide by right livelihood, spiritual observances, and discipline.

source: ལྷ་ཡི་ལྷ་མཆོག་དྲི་མེད་དྲི་མ་བྲལ། །ཕ་རོལ་ཚོགས་འཇོམས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Foremost among gods, you are free from stains And defeat hostile forces; I pay homage to you!

source: བདེ་གཤེགས་རིན་ཆེན་མཆོག་ཏུ་དགའ་མཛད་པ། །དགོན་པར་རྟག་གནས་རྟག་ཏུ་དགོན་པར་དགྱེས། །
en: “Blissful One, like a supreme jewel, you bring joy. You always reside in isolated places and enjoy solitude.

source: རྡུལ་སྐྱོན་གཏི་མུག་རྙོག་པ་མི་མངའ་བ། །ནམ་མཁའ་མཉམ་ཐུགས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Unsullied by stains, faults, and ignorance, Your mind is equal to space; I pay homage to you!

source: ཆུ་བོ་བཞི་རྒལ་བདེན་བཞི་བཀའ་མཆིད་གསུང་། །
en: “You have crossed the four rivers and proclaim the discourse on the four truths,

source: མིག་སྦྱིན་བདུད་རྩི་ཆོས་ཀྱི་བཀའ་མཆིད་ཅན། །
en: You give away your eyes, and you reveal the nectar-like Dharma discourses.

source: འགྲོ་བའི་དོན་མཛད་འཇིག་རྟེན་གསུམ་རྒྱུ་བ། །འཁོར་ལོ་ཞབས་མངའ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: With your feet marked by wheels, you roam throughout the three worlds To accomplish the benefit of beings; I pay homage to you!

source: !ལྷ་དང་མིས་མཆོད་པ་ཡི་མཐུ་བོ་ཆེ། །མགོན་པོ་ལྷ་ཡི་དབང་པོ་བདུན་འཇོམས་པ། །མི་དང་ལྷ་ཀླུ་ཚོགས་ཀྱིས་མནོད་པ་ཡི། །མི་མཆོག་དམ་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Powerful One, you are worshiped by gods and humans. Protector, you defeat Māra, the lord of the gods. You are revered by hosts of humans, gods, and nāgas. Sublime and foremost among humans, I pay homage to you!

source: !རྟག་ཏུ་བདེ་སྡུག་དམ་པའི་ཆོས་ལ་དགྱེས། །མཉམ་ཐུགས་འགྲོ་བ་ཀུན་ལ་བྱམས་པའི་ཐུགས། །ཆོས་ལ་མཉམ་གནས་མི་རྣམས་ཁ་ལོ་སྒྱུར། །ཡོན་ཏན་མཐར་ཕྱིན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Always delighted by the sacred Dharma that contains the truth, You love all beings with an impartial mind. Ruler of humans, you constantly abide by the Dharma And you have perfected all excellent qualities; I pay homage to you!

source: སྙན་པའི་སྒྲ་དབྱངས་རྣམ་པར་དག་དང་ལྡན། །ཚངས་པའི་སྒྲ་དབྱངས་ལྟ་བུར་འཇམ་པའི་གསུང་། །ཐམས་ཅད་དབྱངས་ཀྱི་ཡན་ལག་གསུང་ཚུལ་རྫོགས། །བདེན་པ་སྙན་གསུང་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “You speak in pure and delightful tones And your voice is soft like the voice of Brahmā. Having perfected all the elements of speech, You convey the truth in a melodious way; I pay homage to you!

source: སྟོང་པ་མཚན་མ་མེད་ཅིང་སྨོན་དང་བྲལ། །ཟབ་མོ་བལྟ་དཀའ་ཤིན་ཏུ་རྟོགས་པར་དཀའ། །ཐར་ལ་འཇུག་པར་མཁས་པ་བློ་གྲོས་ལྡན། །ཐར་པའི་ལམ་དགྱེས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Wise One, you are expert in the entry to the liberations— The profound emptiness, the absence of marks, and the absence of wishes That are difficult to perceive and extremely hard to realize— And you are delighted by the path of liberation; I pay homage to you!

source: རྒྱུ་ལ་རྟེན་པ་མཁས་པའི་བཅོམ་ལྡན་འདས། །མཐའ་གཉིས་ལྟ་བ་རྟག་ཏུ་མི་མངའ་བ། །ལས་ཀྱི་རྣམ་སྨིན་འབྲས་བུ་ཁོ་ན་གསུང་། །ལྟ་བའི་མུན་བྲལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Blessed One, you are expert in causality. Forever free from the views of the two extremes, You only describe the ripened effects of actions, And you are liberated from the darkness of views; I pay homage to you!

source: !གང་ནས་མ་བྱོན་གང་དུའང་གཤེགས་མ་ལགས། །རྟག་ཏུ་དབེན་པའི་ཆོས་རྣམས་རབ་གསུང་བ། །སྨིག་རྒྱུ་རྒྱུ་བཞིན་ང་ཡི་མི་མངའ་བ། །དགེ་བའི་ཆོས་ཚུལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “You expound on phenomena that are always void— That do not come from or go anywhere— Phenomena that are free of ‘mine,’ like mirages and illusions. You who teach the way of the virtuous Dharma, I pay homage to you!

source: སྐྱེ་བ་མི་སྐྱེ་གང་དུའང་སྐྱེ་མ་ལགས། །སྐྱེ་དང་འཇིག་དང་གང་དུའང་མི་བས་པ། །ཆོས་ཀྱི་གནས་ཉིད་ཇི་ལྟའི་གནས་ལ་གནས། །གནས་ལ་མི་གནས་རྒྱལ་ལ་ཕྱག་འཚལ་ལོ། །
en: “That which arises is unborn—it does not arise anywhere. It arises and disintegrates, without vanishing anywhere. The abiding mode of phenomena abides in the natural ground; I pay homage to the Victor who does not abide anywhere!

source: དེ་བཞིན་ཁོ་ན་དེ་བཞིན་ཡང་དག་གསུང་། །རྟག་ཏུ་མི་གཡོ་དེ་བཞིན་ཉིད་ལ་བཞུགས། །
en: “Your teachings always accord with the way things are, And you continuously dwell within suchness, without wavering.

source: རི་རབ་རྒྱལ་མཚན་རྡོ་རྗེ་འདྲ་བའི་སྐུ། །མི་གཡོ་རི་རབ་མཚུངས་ལ་ཕྱག་འཚལ་ལོ། །
en: Your body, like Mount Sumeru, a victory banner, and a vajra, Is unshakeable like the Supreme Mountain; I pay homage to you!

source: སྐུ་ནི་དབེན་ཞིང་མཉམ་ཐུགས་བློ་ལྡན་པ། །གྲགས་པ་མཐའ་ཡས་འཇིག་རྟེན་གསུམ་གྲགས་པ། །སྐྱེས་བུ་མཆོག་ལ་ཞུ་བ་ཞུས་པ་རྣམས། །འཇིག་རྟེན་ཟླ་བས་མྱུར་དུ་སྐབས་དབྱེར་གསོལ། །
en: “Wise One, your body is disengaged, your mind impartial, And your infinite fame pervades the three worlds. Supreme being, moon of the world, please agree To answer questions posed to you!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷའི་ཅོད་པན་གྱིས་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After the bodhisattva great being Divyamauli had praised the Blessed One with these fitting verses of praise, he said,

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གིས་ཞུས་པ་ལུང་བསྟན་པའི་སླད་དུ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་སྐབས་དབྱེ་བར་གནང་ན་བཅོམ་ལྡན་འདས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །
en: “Blessed One, should I be granted the opportunity, I would like to ask a few questions of the Blessed One, the thus-gone one, the worthy one, the perfect Buddha.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷའི་ཅོད་པན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied,

source: རིགས་ཀྱི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་། ངས་
en: “Noble son, ask whatever you wish of the Thus-Gone One, the worthy one, the perfect Buddha.

source: དྲི་བ་དྲིས་པ་དེ་དང་དེའི་ལུང་བསྟན་པས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ། །
en: I will answer your questions and bring satisfaction to your mind.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷའི་ཅོད་པན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ཏེ།
en: The bodhisattva great being Divyamauli said, “Excellent!” and,

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་ཅིང་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: heeding the Blessed One’s instructions, put his questions to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྤོབས་པ་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་ལྡན་པ་རྣམས་ལགས།
en: “Blessed One, how do bodhisattvas become adorned with various types of eloquence?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཟབ་མོ་རྣམ་པར་གདོན་མི་ཟ་བ་ལ་འཇུག་པ་ཤེས་པ་ལ་མཁས་པ་རྣམས་ལགས།
en: How do bodhisattvas become experts in the knowledge that is free of doubts with respect to the profound Dharma?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ལགས་པ་ཤེས་པ་ལ་མཁས་པ་རྣམས་ལགས།
en: How do bodhisattvas become experts in knowing which sentient beings are of the highest faculties and which are not?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སོ་སོ་ཅི་རིགས་པར་ཆོས་སྟོན་པ་ལ་མཁས་པ་རྣམས་ལགས།
en: How do bodhisattvas become experts in teaching the Dharma in accordance with each being individually?

source: !ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་ཀྱི་བསམ་པ་མཉམ་ཞིང་སྤྱོད་པ་ཤེས་པ་ལ་འཇུག་པར་མཁས་པ་རྣམས་ལགས།
en: How do bodhisattvas become experts in knowing the mental activity of all beings?

source: !ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྒྱུ་དང་དབྱེ་བ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་འཇུག་པ་ཤེས་པ་ལ་བརྗེད་པ་མ་མཆིས་པར་སྤྱོད་པ་རྣམས་ལགས།
en: How do bodhisattvas act without forgetting the knowledge of how causes, deeds, and actions ripen?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པའི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ལགས།
en: How do bodhisattvas become adorned with the ornament of generosity?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ལགས།
en: How do bodhisattvas become adorned with the ornament of discipline?
